public/signed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
            <soapenv:Header/>
            <soapenv:Body><RegisterInvoiceRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="https://efi.tax.gov.me/fs/schema" Id="Request" Version="1">
    <Header SendDateTime="2021-04-13T14:43:19+02:00" UUID="8e8534db-9e93-4511-ae24-6b3507538e88"/>

    <Invoice TypeOfInv="NONCASH" IsSimplifiedInv="false" IssueDateTime="2021-04-13T14:43:19+02:00" InvNum="xx123xx123/7/2021/si747we972" InvOrdNum="7" TCRCode="si747we972" IsIssuerInVAT="true" TotPriceWoVAT="155.00" TotVATAmt="100.00" TotPrice="255.00" OperatorCode="oo123oo123" BusinUnitCode="xx123xx123" SoftCode="ss123ss123" IIC="07017f0698650dbc17ab01e4bfd74fa8" IICSignature="3af8d2d4ee03ed2e7a8f5cb3cb75de6216645b1ebedff2f4e7d02539914a08fca29b3fc8c4f88b97e0c2b6d4b9fa24174269fddf8c3dfbb8c5a0ade866e8fc0f2c942fc32b251320a466e2e529206ca7cfc7c50f9b8b70065ddc275f4e92ac6bc6cadb9ff32cd5b78ac64f87311ac6aec39dc2643236afe550685ef6ed26a977bba18b5c19359e76f4e0ee649d2c4606b9b5dd8fab2fcb0be7b57e942d2378358f92ba55fda08189303462775c71890b72e49971b038de5a3ab8c8d28648be17fdce4cd0979be63106be287d222786dc1b9ad89c3410c32b76bdb1b84af0f39a214708379c8953b1e8b2220dcd8bfb5e8681113107d967ddd85b567e2a1226c5" IsReverseCharge="false">
        <PayMethods>
            <PayMethod Type="ADVANCE" Amt="255.00"/>
        </PayMethods>

        <Seller IDType="TIN" IDNum="12345678" Name="Intours"/>

        <Buyer IDType="TIN" IDNum="12345678" Name="Vitka"/>

        <Items>
                            <I N="quaerat" C="0" U="kom" Q="1.00" UPB="155.00" UPA="0.00" R="55.00" RR="1" PB="0.00" VR="0.07" VA="100.00" PA="255.00"/>
                    </Items>

        <SameTaxes>
                                                                            <SameTax NumOfItems="1" PriceBefVAT="155.00" VATRate="7.00" VATAmt="100.00"/>
                                                                </SameTaxes>
    </Invoice>
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
  <SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
    <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
  <Reference URI="#Request"><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><DigestValue>D3B1M9m48klYDHypFstrxeY8jxfaqWVtkEWC1z13GxE=</DigestValue></Reference></SignedInfo><SignatureValue>pJUG+o/vRNaOC/BsnXFOO2HNqY9MFxjbzjrXu8M82M9C0vw8+DfyceprYIz6idEjZ1pVmGsPbyZ2eCuYsOx4AbJeaTA5NOyqWdzGUHUujJXpdhfs+f9lqhiytOCjfWroEHW8H/JNtpmmxPy/pTnFKyC/FIalXRXnk7NOF2w+EZxbgfBHHwegMM/AVeVZoh00uUi8Jl6kzmW8xNgBaK4/G9Q9R19A1NNFWvv++BGSHMkbAhv2jU3Ad5BEBLFG7S6Ebq+Ey5UMbFO+l8fDHIpkxwuZDmHZcINKLL4otBBj4hnCEzTYMsqpUbhSGaDyoHen5+qzRe9YOv7UDhHEta6hEQ==</SignatureValue>
<KeyInfo><X509Data><X509Certificate>MIIFoDCCBAigAwIBAgIIAosoHBIRrfUwDQYJKoZIhvcNAQELBQAwTzELMAkGA1UE
BhMCTUUxDzANBgNVBAoMBkNvcmVpdDEXMBUGA1UEYQwOVkFUTUUtMDI3NzUwMTgx
FjAUBgNVBAMMDUNvcmVpdCBTdWIgQ0EwHhcNMjAxMDA1MTIxNDQ3WhcNMjMxMDA1
MTIxNDQ3WjCBmzELMAkGA1UEBhMCTUUxGjAYBgNVBAoMEVRlc3QgT25seSBDb21w
YW55MRcwFQYDVQRhDA5WQVRNRS0xMjM0NTY3ODESMBAGA1UECwwJT3BlcmFjaWpl
MQ4wDAYDVQQFEwUxMDAwMTEzMDEGA1UEAwwqVGVzdCBPbmx5IENvbXBhbnkgKFBl
xI1hdC9BdXRlbnRpZmlrYWNpamEpMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIB
CgKCAQEAqzK8vMGchz7qc5K7eqvLy3kMIO7omEv406wLU+vIMIeusmwebrVYCd03
EdMrI6ktDFiUuQbD1Ze0+oxpBLT9iFpB3njTf+z2phI5BNkEseHGxc0BrT8S2DTG
qO13xAYwcqViK6cARfpgzpRB6B1HLVKmW5PwlwNQlmXuM61bQqyaPLrToNex+drV
ybO9r2zLQzY5ztNV5F1Uy/pQnggZt2qRyFO71cW/D7+Vc1d14DGG4gy3TmW36BQK
3zSGBy11psNLLsNDPl14JaqrKZgKv9o6M9+qZ0yb08HHoURkR91XsbJ0YnUZJy+D
jy6rya7iqqN5y5MIc9qfdul7HI/FuQIDAQABo4IBsTCCAa0wDAYDVR0TAQH/BAIw
ADAfBgNVHSMEGDAWgBRS3xfznifJOu61Gx/QkwDS8wtU/jBxBggrBgEFBQcBAQRl
MGMwLwYIKwYBBQUHMAKGI2h0dHA6Ly9jYS5jb3JlaXQubWUvQ29yZWl0U3ViQ0Eu
Y2VyMDAGCCsGAQUFBzABhiRodHRwOi8vb2NzcC5jYS5jb3JlaXQubWUvQ29yZWl0
U3ViQ0EwQgYDVR0gBDswOTA3Bg0rBgEEAYOjKQEBAgIBMCYwJAYIKwYBBQUHAgEW
GGh0dHA6Ly9jYS5jb3JlaXQubWUvY3BzLzBcBggrBgEFBQcBAwRQME4wCAYGBACO
RgEBMBMGBgQAjkYBBjAJBgcEAI5GAQYCMC0GBgQAjkYBBTAjMCEWG2h0dHBzOi8v
Y2EuY29yZWl0Lm1lL3Bkcy9lbhMCZW4wOAYDVR0fBDEwLzAtoCugKYYnaHR0cDov
L2NybC5jYS5jb3JlaXQubWUvQ29yZWl0U3ViQ0EuY3JsMB0GA1UdDgQWBBSLBPEd
crmjuxuatJAJ3dUzJmzzbjAOBgNVHQ8BAf8EBAMCBsAwDQYJKoZIhvcNAQELBQAD
ggGBACp0Yi52FnYapjzVv//lC17uU6EKrIomCs1QUQSQE7zXrz4pBgnB3v4mNS1g
0EzFtzfkIspjQex1Y8D/SdgtFrVmwfmUhsI/GLtr1VvlSVTMdRoekGDHS8J89wna
rebV3pxfIFpmKw3iqQwIQXur5gXCRojPehJoAg3J/YhA1XT6D0aEYJVhRjIuSqee
c/G7XIDKnr8sOy+iOBaHVjvnQ5cYmXgVyslDuWFZ7N5mRrWYreXX+WaOAQf1+zEq
BsRwZp7jAU62dmI4D4C/FqrANhOby6FKOjCylX7VrF3igZyQ+KHVETSxqJXMTyQ9
uBRZ/G+lubDfjGVlcwznQLPpo3VFpExIvS8Ne/5M1KJjBcVhzc2lPC5ObIyu+Tex
IYNvuj2FwRs9xLGAwkO0LMJNfjYPItWhBoHZej3SUScgBGtI6p9n8xFrMly93tAJ
+GhBX4Wncz3TAUhkhH8jPvJUJVYil1QGToOCBIp/XD76BbF67Q/DStDSCeU68CqS
oTQLMw==
</X509Certificate></X509Data></KeyInfo></Signature></RegisterInvoiceRequest>
</soapenv:Body>
            </soapenv:Envelope>